xfire-aegis/src/test/org/codehaus/xfire/rpclit/echo-nil.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <m:echo xmlns:m="urn:Echo">
   <echo xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
  </m:echo>
 </env:Body>
</env:Envelope>